devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 */
//==============================================================================
MODULE__DEVICE_WRITE(SDSPI)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(item_size == 0);
        STOP_IF(n_items == 0);

        struct sdspi_data *hdl = device_handle;

        size_t n = 0;
        if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_write(hdl, src, item_size, n_items, lseek);
                unlock_mutex(hdl->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 */
//==============================================================================
MODULE__DEVICE_READ(SDSPI)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(item_size == 0);
        STOP_IF(n_items == 0);

        struct sdspi_data *hdl = device_handle;

        size_t n = 0;
        if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_read(hdl, dst, item_size, n_items, lseek);
                unlock_mutex(hdl->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Direct IO control
 */
//==============================================================================
MODULE__DEVICE_IOCTL(SDSPI)
{
        STOP_IF(device_handle == NULL);

        struct sdspi_data *hdl = device_handle;

        stdret_t status = STD_RET_OK;

        switch (iorq) {
        case SDSPI_IORQ_INITIALIZE_CARD:
                if (lock_mutex(hdl->card_protect_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                        bool *result = va_arg(args, bool*);
                        *result      = false;

                        vfs_remove(SDSPI_PARTITION_1_PATH);
                        vfs_remove(SDSPI_PARTITION_2_PATH);
                        vfs_remove(SDSPI_PARTITION_3_PATH);
                        vfs_remove(SDSPI_PARTITION_4_PATH);

                        if (initialize_card(hdl) == STD_RET_OK) {
                                if (detect_partitions(hdl) == STD_RET_OK) {
                                        *result = true;
                                }
                        }

                        unlock_mutex(hdl->card_protect_mtx);
                } else {
                        status = STD_RET_ERROR;
                }
                break;

        default:
                status = STD_RET_ERROR;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 */
//==============================================================================
MODULE__DEVICE_FLUSH(SDSPI)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Interface returns device information
 */
//==============================================================================
MODULE__DEVICE_STAT(SDSPI)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        struct sdspi_data *hdl = device_handle;

        if (lock_mutex(hdl->card_protect_mtx, MTX_BLOCK_TIME_LONG) == MUTEX_LOCKED) {
                /* size info */
                if (send_cmd(hdl, CMD9, 0) == 0) {
                        u8_t  csd[16];
                        u8_t  token;
                        uint  try = 1000000;

                        while ((token = spi_rw(0xFF)) == 0xFF && --try);
                        if (token != 0xFE)
                                return STD_RET_ERROR;

                        u8_t *ptr = &csd[0];
                        for (int i = 0; i < 4; i++) {
                                *ptr++ = spi_rw(0xFF);
                                *ptr++ = spi_rw(0xFF);
                                *ptr++ = spi_rw(0xFF);
                                *ptr++ = spi_rw(0xFF);
                        }
                        spi_rw(0xFF);
                        spi_rw(0xFF);

                        /* SDC version 2.00 */
                        device_stat->st_size = 0;
                        if ((csd[0] >> 6) == 1) {
                                int csize     = csd[9] + ((u16_t)csd[8] << 8) + 1;
                                device_stat->st_size = (u64_t)csize << 10;
                        } else { /* SDC version 1.XX or MMC*/
                                int n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                                int csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                                device_stat->st_size = (u64_t)csize << (n - 9);
                        }
                        device_stat->st_size *= SECTOR_SIZE;
                        device_stat->st_major = 0;
                        device_stat->st_minor = 0;
                }

                unlock_mutex(hdl->card_protect_mtx);
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function open new partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  flags            file open flags
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

        if (hdl->in_use == true)
                return STD_RET_ERROR;
        else
                return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  forced           force close
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *device_handle, bool forced)
{
        UNUSED_ARG(forced);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

